{"elements":[{"type":"warning","text":"This page is still being\nreviewed and rewritten.\n\nDO NOT LINK TO THIS PAGE\nUNTIL THIS WARNING IS GONE."},{"type":"label","text":"The graphics workspace is where you make the\nsprites for your cartridges. Like the other\neditor workspaces there is a hamburger menu at\nthe top left and file tabs along the top of the\ntoolbar."},{"data":"b64:bHo0AKkBAABPBAAA-wFweHUAQyDwQATw-1L1bvBiBAAK8AtiZkXwYvVWbTU2BTY18GL1VT0FPRU2BQYFJg4A_AVUPQUNBS0FpjXwFQXwEgXwGfVTrQ4AIFK9DgBTE-UY8BcMAAoaAAcOABWtDgCwFfBqFfAVBSD3CGAOAOkA5_8U5O8f7w-o7xjiABoAPwfABxwANy4MIG4ACRoA3_8V5e8W5ufvF_8O7x4bAChvYLw3Pw43HgAv3_HvEO8R7O8c7x3t7xIeABBPILc8txwAR8LvE_PvG_vvGurp7xkbAACMAC_8YB0AWwN2ASfwag4AL-VuDAAUP2D3CAwAFfQKpQfFHbUNVW11LbUNpS11HQUNBR11DQUNhcUC8AeVJ6UdtQ1lDUUNZQ0lDbUNlS11DUUNIwA0BQ1lJQBghUeFHbUNGQCjVQ1FDbUNhS31ByIAATQDMHVHlRYAAyAAMmVtdUUAFU1BAEBlBwUnQwATlSMAqFUNBU1lbfUDDQUkAHMVB5UdpQ2ljABTZQ0VLXUwAHBlXWXwYmUnHwARtV4AUiUNhW1VzgAnPXUHBA8EAANQYvVu8OE=","type":"pod_image"},{"type":"label","text":"In the center of the page is the sprite editor, \nthis is where you draw any sprites for your\nprograms. At the bottom left of the screen you\ncan see the current pixel coordinates local to\nthe sprite your mouse is at. The origin is at\nthe top left of the sprite (Not the bottom left\nlike in other software)."},{"type":"label","text":"On the right side of the workspace is the \ngraphics menu, it contains a wide variety\nof tools to draw your sprites with."},{"type":"label","text":"At the top of the side bar is the color palette.\nThe first tab (not focused by default) shows all\n64 colors in index order. The other tab is a\npalette organized to show gradients better, this\nonly shows the 32 default colors.\n\nIn each tab you can click a color to select it."},{"type":"label","text":"Below the palette is the toolbar, with tools\nto edit the sprite you have selected.\n"},{"type":"label","text":"Pen\nSets the pixel you are hovering over to the\nselected color. Right-clicking will set the\ncurrently selected color to the same color\nthat you are hovering over in the editor.\n\nBrush\nDraws with the size selected, you can also\nselect a pattern below the toolbar whenever\nthis tool is selected.\n\nLine\nAllows easily drawing pixelated lines from\none point to another.\n\nRectangle\nAllows easily drawing pixelated rectangles\nfrom corner to corner. You can hold control\nto make it filled.\n\nCircle\nAllows easily drawing pixelated circles from\ncorner to corner. You can hold control to make\nit filled.\n\nFill bucket\nClicking will fill in whatever was clicked\nwith the selected color.\nStamp\n\nAllows for stamping down copies of whatever\nis currently on your clipboard, you can copy\na sprite with CTRL-C. You can also copy the\ncurrent selected area.\n\nSelection\nAllows you to select a region on the sprite\nyou are editing, clicking and dragging from\ncorner to corner.\n\nPan\nAllows you to move the viewport of the sprite\nyou are editing. You can also use the spacebar\nto activate this tool without clicking it."},{"type":"label","text":"Lastly is the sprite panel. This shows a grid\nyour sprites, with four tabs (256 sprites per\nfile). Above this you can see a preview of the\nsprite you have selected. Directly next to the\npreview are two fields with integers in them\n(By default they are both 16), this controls\nthe size (in pixels) of the sprite you have\nselected. There is a small padlock icon in the\nmiddle, if it is locked then the ratio of the\nsprite will be retained when resizing it."},{"type":"note","text":"For a sprite's size to change you'll need to\npress enter."},{"type":"label","text":"To the right of the sprite size you can edit the\nsprite flags, these are allow you to store an\nextra byte of data in each sprite. You do this\nby clicking on and off the little lights. These\ndon't do anything by default, but are useful for\nmaking sprites behave differently.\n\nA good use case of these sprite flags is to\ndecide which sprites collide with the player."}],"metadata":{"authors":["BouncyBonBon","scrapSavage"],"page_title":"Graphics Workspace","version":"0.4"}}
